src/Catalogs/РелизыОбновлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>РелизыОбновлений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdInfo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/РелизыОбновлений/Ext/ObjectModule.bsl
//
//
Процедура ПередЗаписью(Отказ)
	
	Данные_UpdInfo = Справочники.РелизыОбновлений.Прочитать_UpdInfo(ЭтотОбъект.Каталог);
	Если Данные_UpdInfo.Свойство("Version") Тогда
		Попытка ЭтотОбъект.Наименование = Данные_UpdInfo.Version; Исключение КонецПопытки;		
	КонецЕсли;
	Если Данные_UpdInfo.Свойство("FromVersions") Тогда		
		Попытка ЭтотОбъект.UpdInfo = Данные_UpdInfo.FromVersions; Исключение КонецПопытки;
	КонецЕсли;
	
	Данные_1cv8_mft = Справочники.РелизыОбновлений.Прочитать_1cv8_mft(ЭтотОбъект.Каталог);
	Если Данные_1cv8_mft.Свойство("Version") Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда
			Попытка ЭтотОбъект.Наименование = Данные_1cv8_mft.Version; Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Если Данные_1cv8_mft.Свойство("Name") Тогда
		ВыбранныйВидКонфигурации = СокрЛП(ЭтотОбъект.ВидКонфигурации.Наименование);
		Если ВРег(СокрЛП(Данные_1cv8_mft.Name)) <> ВРег(ВыбранныйВидКонфигурации) Тогда
			ОбщегоНазначенияСервер.ВывестиСообщение("Выбранный каталог содержит обновление [" + Данные_1cv8_mft.Name + "] отличное от заданного [" + ВыбранныйВидКонфигурации + "]");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.НомерДляСортировки = ОбщегоНазначенияСервер.ДополнитьНулямиЧисловыеЗначенияСтрокиРелиза(СокрЛП(ЭтотОбъект.Наименование));
	
КонецПроцедуры
